/*****************************************************************************
 *
 * Filename:
 * ---------
 *     s5k3l2xxmipi_Sensor.c
 *
 * Project:
 * --------
 *     ALPS
 *
 * Description:
 * ------------
 *     Source code of Sensor driver
 *
 *
 *------------------------------------------------------------------------------
 * Upper this line, this part is controlled by CC/CQ. DO NOT MODIFY!!
 *============================================================================
 ****************************************************************************/

#include <linux/videodev2.h>
#include <linux/slab.h>
#include <linux/i2c.h>
#include <linux/platform_device.h>
#include <linux/delay.h>
#include <linux/cdev.h>
#include <linux/uaccess.h>
#include <linux/fs.h>
#include <asm/atomic.h>
#include <linux/xlog.h>

#include "kd_camera_hw.h"
#include "kd_imgsensor.h"
#include "kd_imgsensor_define.h"
#include "kd_imgsensor_errcode.h"

#include "s5k3l2xxmipiraw_Sensor.h"

/****************************Modify Following Strings for Debug****************************/
#define PFX "S5K3L2XX_Largen_camera_sensor"
#define LOG_1 LOG_INF("S5K3L2XX_Largen,MIPI 4LANE\n")
#define LOG_2 LOG_INF("preview 2096*1554@30fps,864Mbps/lane; video 4196*3108@30fps,864Mbps/lane; capture 13M@30fps,864Mbps/lane\n")
/****************************   Modify end    *******************************************/


    .i2c_addr_table = {0x20, 0xff},//record sensor support all write id addr, only supprt 4must end with 0xff
    .i2c_speed = 300, 
};


static imgsensor_struct imgsensor = {
    .mirror = IMAGE_NORMAL,                //mirrorflip information
    .sensor_mode = IMGSENSOR_MODE_INIT, //IMGSENSOR_MODE enum value,record current sensor mode,such as: INIT, Preview, Capture, Video,High Speed Video, Slim Video
    .shutter = 0x3D0,                    //current shutter
    .gain = 0x100,                        //current gain
    .dummy_pixel = 0,                    //current dummypixel
    .dummy_line = 0,                    //current dummyline
    .current_fps = 300,  //full size current fps : 24fps for PIP, 30fps for Normal or ZSD
    .autoflicker_en = KAL_FALSE,  //auto flicker enable: KAL_FALSE for disable auto flicker, KAL_TRUE for enable auto flicker
    .test_pattern = KAL_FALSE,        //test pattern mode or not. KAL_FALSE for in test pattern mode, KAL_TRUE for normal output
    .current_scenario_id = MSDK_SCENARIO_ID_CAMERA_PREVIEW,//current scenario id
    .ihdr_en = 0, //sensor need support LE, SE with HDR feature
    .i2c_write_id = 0x20,//record current sensor's i2c write id
};


/* Sensor output window information */
static SENSOR_WINSIZE_INFO_STRUCT imgsensor_winsize_info[5] =
{{ 4208, 3120, 0000, 0000, 4208, 3120, 2104, 1560, 0000, 0000, 2104, 1560, 0003, 0003, 2096, 1552}, // Preview 
 { 4208, 3120, 0000, 0000, 4208, 3120, 4208, 3120, 0000, 0000, 4208, 3120, 0007, 0007, 4192, 3104}, // capture 
 //{ 4208, 3120, 0000, 0000, 4208, 3120, 4208, 3120, 0000, 0000, 4208, 3120, 0007, 0007, 4192, 3104}, // video 
 { 4208, 3120, 0000, 0000, 4208, 3120, 1920, 1080, 0000, 0000, 1920, 1080, 0000, 0000, 1920, 1080}, // video 
 { 4208, 3120,  824,  840, 2560, 1440, 1280,  720, 0000, 0000, 1280,  720, 0000, 0000, 1280,  720}, //hight speed video 
 { 4208, 3120,  824,  840, 2560, 1440, 1280,  720, 0000, 0000, 1280,  720, 0000, 0000, 1280,  720} //normal video
};
static kal_uint16 read_cmos_sensor(kal_uint32 addr)
{
	kal_uint16 get_byte=0;
	char puSendCmd[2] = {(char)(addr >> 8), (char)(addr & 0xFF)};
		
	kdSetI2CSpeed(imgsensor_info.i2c_speed);
	iReadRegI2C(puSendCmd, 2, (u8*)&get_byte, 1, imgsensor.i2c_write_id);
		
	return get_byte&0x00ff;
}


static void write_cmos_sensor1(kal_uint32 addr, kal_uint32 para)
{
	char puSendCmd[4] = {(char)(addr >> 8), (char)(addr & 0xFF),  (char)(para >> 8), (char)(para & 0xFF)};
	
	kdSetI2CSpeed(imgsensor_info.i2c_speed);
	iWriteRegI2C(puSendCmd, 4, imgsensor.i2c_write_id);
}



static void write_cmos_sensor(kal_uint32 addr, kal_uint32 para)
{
	char puSendCmd[4] = {(char)(addr >> 8), (char)(addr & 0xFF), (char)(para & 0xFF)};
	
	kdSetI2CSpeed(imgsensor_info.i2c_speed);
	iWriteRegI2C(puSendCmd, 3, imgsensor.i2c_write_id);
}


/*-------OTP define----------------*/

#define OTP_DATA_READ      1
#define E2PROM_WRITE_ID    0xA0
#define PRIMAX_MODULE_ID   0x03
#define LSC_START_ADDR	   0x2C
#define PRIMAX_LSC_SIZE    1508

extern int af_inf_pos;
extern int af_macro_pos;

typedef struct {
	u8 awb_flag;     //0x00:Empty 0x01:Invalid  0x11:Valid
	u8 unit_R;
	u8 unit_Gr;
	u8 unit_Gb;
	u8 unit_B;
	u8 golden_R;
	u8 golden_Gr;
	u8 golden_Gb;
	u8 golden_B;
	u16 checksum; //Sum(0x17, 0x1E) %FFFF + 1
}awb_struct;

typedef struct {
	u8 af_flag;   //0x00:Empty 0x01:Invalid 0x11:Valid
	u8 underspin_flag;   //0x00: no underspin  0x01: underspin
	u16 af_start_current;
	u16 af_infinity;
	u16 af_macro;
	u16 checksum;  //Sum(0x22, 0x28) %FFFF + 1
}af_struct;


typedef struct{
	u8 program_flag;
	u8 module_id;
	u32 program_name;  //0x4D:M,0x30:0,0x37:7,0x31:1
	u8 version_id;
	u8 production_year;
	u8 production_month;
	u8 production_day;
	u8 sensor_id;    //0x04: s5k3l2xx
	u8 lens_id;   //0x02: LargenLA50013A1
	u8 vcm_id;     //0x02:TDK TVF-669ABA0x03: Optis OPA6547C-85AL
	u8 vcm_driver_ic;   //0x02:BU64245GWZ
	u8 IR_id;      //0x01:BG62
	u8 AF_flag;
	u32 primax_sn;
	u16 checksum;  //Sum(0x01, 0x13) %FFFF + 1
	
	//awb AF LSC struct data	
	awb_struct *otp_awb;
	af_struct *otp_af;

}primax_otp_struct;

static primax_otp_struct *primax_otp_data;
u8 primax_lsc_data[PRIMAX_LSC_SIZE];

static void read_otp_byte(u8 addr, u8 *buf,u8 write_id)
{
	int i;
	int ret = 0;
	u8 pu_send_cmd[1] = {(u8)addr};
	
	ret = iReadRegI2C(pu_send_cmd, 1 , buf, 1, write_id);
	if (ret < 0)
		printk("read data from primax otp e2prom failed! error reg addr: 0x%X\n",pu_send_cmd[0]);
//	else 
//		printk("read data i2c_addr=0x%X addr=0x%X,data=0x%X\n",write_id,pu_send_cmd[0],*buf);
}

static void read_lsc_data(void){
	u8 write_id = E2PROM_WRITE_ID;
	u8 addr = 0;
	u16 ptr_addr =0;

	for(ptr_addr = LSC_START_ADDR;ptr_addr < LSC_START_ADDR+PRIMAX_LSC_SIZE;ptr_addr++){
		addr = ptr_addr%256;
		if( addr == 0) 
			write_id+=2;
		read_otp_byte(addr,&primax_lsc_data[ptr_addr-LSC_START_ADDR],write_id);
	}
}

